# type()함수 자료형 확인
print(type("안녕하세요")) # 자료형
print(type('안녕하세요'))
print(type('a'))
print(type(273))
print(type(11.1))
print("\"안녕하세요\"라고 말했습니다.") # 이스케이프 문자
print("\'안녕하세요\'라고 말했습니다.")
print("'안녕하세요'라고 말했습니다.")
print('"안녕하세요"라고 말했습니다.') # ", ' 문자의 처리방법
print('"안녕하\\세요"라고\n 말했\t습니다.')
print("\\\\\\\\")
print("동해물가 백두산이 마르고 닳도록\n 하느님이 보우하사 우리나라 만세\n 무궁화 삼천리 화려강산 대한사람\n 대한으로 길이 보전하세")

# """ """ 또는 ''' ''' 입력한 그대로 나타내기
print("""동해물가 백두산이 마르고 
         하느님이 보우하사 우리나라 만세
         무궁화 삼천리 화려강산 대한사람""")

print('''동해물가 백두산이 마르고 
         하느님이 보우하사 우리나라 만세
         무궁화 삼천리 화려강산 대한사람''')


print("안녕" + "하세요")
print("안녕" , "하세요")

# 오류 (TypeError) print("안녕" + 1)

print("안녕하세요"*3) # 3회반복
print(3*"안녕하세요") # 3회반복











 










